{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Structured feature evidence listing resume-import related features and their associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for multiple frontend components and utilities.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light/dark modes with global styling rules.",
  "frontend/index.html": "Main HTML entry point configuring metadata, fonts, favicon, and mounting the React app.",
  "frontend/src/App.tsx": "Top-level React component wiring navigation, dialogs, and all portfolio sections using content overrides.",
  "frontend/src/components/portfolio/AboutSection.tsx": "Renders the About section with a title and multiple paragraphs from content data.",
  "frontend/src/components/portfolio/ContactSection.tsx": "Contact section with email link and a validated contact form handling success and error states.",
  "frontend/src/components/portfolio/ExperienceSection.tsx": "Timeline-style experience and education section rendering items with icons and descriptions.",
  "frontend/src/components/portfolio/FillMyDetailsDialog.tsx": "Dialog for editing portfolio details, validating fields, and generating patches from resume text.",
  "frontend/src/components/portfolio/Footer.tsx": "Footer displaying social links, action buttons, and attribution with dynamic icons.",
  "frontend/src/components/portfolio/HeroSection.tsx": "Hero section rendering avatar, name, role, bio, and CTA buttons with smooth scroll behavior.",
  "frontend/src/components/portfolio/ProjectsSection.tsx": "Projects grid showing project cards with thumbnails, descriptions, tech badges, and external links.",
  "frontend/src/components/portfolio/RequestChangesDialog.tsx": "Dialog allowing users to select a section, describe requested edits, and send them via email.",
  "frontend/src/components/portfolio/SkillsSection.tsx": "Skills section grouping skill categories and listing skills with badges.",
  "frontend/src/components/portfolio/TopNav.tsx": "Responsive top navigation bar with smooth-scrolling links and buttons for filling details or requesting changes.",
  "frontend/src/content/portfolioContent.ts": "Defines the PortfolioContent schema and provides default portfolio data including hero, about, skills, projects, experience, contact, and footer sections.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including login, logout, and persisted identity loading.",
  "frontend/src/hooks/usePortfolioContentOverride.ts": "Manages localStorage overrides for portfolio content with validation, saving, clearing, and fallback to defaults.",
  "frontend/src/index.css": "Configures Tailwind layers and defines light/dark theme CSS variables, base styles, and accessibility-focused focus rules.",
  "frontend/src/lib/resume/applyPortfolioPatch.ts": "Merges a partial portfolio patch into existing content, applying only valid, non-empty fields and merging social links safely.",
  "frontend/src/lib/resume/parseResumeToPortfolioPatch.ts": "Parses resume text into a structured portfolio patch by extracting name, role, bio, skills, experience, projects, and social links.",
  "frontend/src/lib/resume/summarizePortfolioPatch.ts": "Generates a summary of changes detected in a portfolio content patch by counting valid fields in each section.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers before rendering App.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugin integrations.",
  "project_state.json": "Defines the project’s current state, schema version, features, and metadata for a personal portfolio build."
}